---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadComponent.LoadCaseOrCombinationId
source: html/39b5a86b-e63a-9ea6-0e8c-17f6ab2a48ae.htm
---
# Autodesk.Revit.DB.Structure.LoadComponent.LoadCaseOrCombinationId Property

Load case or combination id.

## Syntax (C#)
```csharp
public ElementId LoadCaseOrCombinationId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null